<?php defined('BASEPATH') OR exit('No direct script access allowed');
/****************************************************************
 * 伯嘉基金 - 全站系统配置 v1.0
 *---------------------------------------------------------------
 * Copyright (c) 2004-2016 CNFOL Inc. (http://www.cnfol.com)
 *---------------------------------------------------------------
 * $author:linfeng $addtime:2016-11-15
 ****************************************************************/
/* 
	memcache
	
	@param server  服务IP,请使用数组配置
	@param expire  缓存过期时间 0:永不过期,单位秒
	@param prefix  缓存keys前缀
	@param filelog 日志文件名称
*/
$config['memcache'] = array
(
	'server' => array(
		array(
        'host'=>'49c98d2dbe1040e2.m.cnszalist3pub001.ocs.aliyuncs.com',
        'port'=>11211,
        'muser' => '49c98d2dbe1040e2',
        'mpassword' => 'Z7wzLfCN',)
	),
	'prefix'   => '',
	'expire'   => 5,
	'filelog'  => 'buyfunds_mem'
);
/*
	dbcache 文件缓存

	@param prefix   缓存文件名前缀
	@param type     缓存存储类型 serialize:序列化保存 array:PHP数组方式保存
	@param expire   缓存文件过期时间,0:永不过期
	@param savepath	缓存路径,默认为CI框架application/cache/
	@param filelog  缓存日志文件名
*/
$config['dbcache'] = array
(
	'prefix'   => 'quotes_api_',
	'type'     => 'serialize',
	'expire'   => '10',
	'savepath' => APPPATH . 'cache' . DIRECTORY_SEPARATOR,
	'filelog'  => 'cnfol_file'
);
/*
	fund_risklevel 基金风险等级分类
	@param array   分别代表不同风险等级的基金类别
*/
$config['fund_risklevel'] = array
(
	'0'=> '默认等级',
	'1'=> '保本等级',
	'2'=> '低风险等级',
	'3'=> '中风险等级',
	'4'=> '中高风险等级',
	'5'=> '高风险等级'
);
/*
	fund_busin_code 业务代码
	@param array   分别代表不同业务类型
*/
$config['fund_busin_code'] = array
(
	'022' =>  '申购',
	'053' =>  '撤单',
);
/*
//1-4现金宝购买 卖出、互转、撤单后的短信通知
//4-11 普通基金产品购买 卖出、转换、撤单后的短信通知
//12 修改基金分红方式的短信通知
//13-17 现金宝定投 修改定投  暂停 恢复 终止定投的短信通知
//18-22 普通基金定投 修改定投  暂停 恢复 终止定投的短信通知 
*/
$config['fund_sms_content'] = array(
    '1' => '您于' . date('m月d日H时i分'). '时，购买现金宝%s元。如有疑问请致电400-027-9899。',
    '2' => '您于' . date('m月d日H时i分'). '时，卖出现金宝%s元。如有疑问请致电400-027-9899。',
    '3' => '您于' . date('m月d日H时i分'). '时，互转现金宝%s元。如有疑问请致电400-027-9899。',
    '4' => '您于' . date('m月d日H时i分'). '时，撤回%s元的现金宝交易。如有疑问请致电400-027-9899。',
    '5'=> '尊敬的客户，您于' . date('m月d日H时i分') . '办理（基金名称基金代码）的申购业务，申请数额xxx，交易申请已受理。客服电话400-027-9899',
    '6' =>'尊敬的客户，您于' . date('m月d日') . '（申请日期）申购（基金名称基金代码）已确认成功，申请金额xxx元，确认份额xxx份，成交净值为xx元，请登录伯嘉基金网，查看详情。客服电话400-027-9899。',
    '7' =>'尊敬的客户，您持有的（基金名称基金代码）于'  . date('m月d日') . '分红已确认，现金红利0元，红利再投xx份，可于两个工作日后查询账户变动，请登录伯嘉基金网，查看详情。客服电话400-027-9899。',
    '8' =>'尊敬的客户，您于%s办理%s的认购业务，申请数额%s，交易申请已受理，请登录伯嘉基金网，查看详情。客服电话400-027-9899。',
    '9' =>'尊敬的客户，您于' . date('Y') . '年' . date('m月d日H时i分'). '时办理（基金名称基金代码）的赎回业务，申请份额xxx，交易申请已受理，请登录伯嘉基金网，查看详情。客服电话400-027-9899。',
    '10' =>'您于' . date('m月d日H时i分') . '，转换（%s）%s份。如有疑问请致电400-027-9899。',
    '11' =>'您于' . date('m月d日H时i分'). '时，进行了（基金名称）xx的撤单操作。如有疑问请致电400-027-9899。',
    '12' =>'您于' . date('m月d日H时i分'). '时，修改了基金分红方式。如有疑问请致电400-027-9899。',
    '13' =>'您于' . date('m月d日H时i分'). '时，进行了现金宝定投操作，定投金额为xx元。如有疑问请致电400-027-9899。',
    '14' =>'您于' . date('m月d日H时i分'). '时，修改了现金宝定投。如有疑问请致电400-027-9899。',
    '15' =>'尊敬的客户，因xxxx原因，现金宝将于' . date('m') . '月' . date('d') . '日暂停定投业务。如有疑问请致电400-027-9899。',
    '16' =>'尊敬的客户，现金宝将于' . date('m') . '月' . date('d') . '日恢复定投业务。如有疑问请致电400-027-9899。',
    '17' =>'尊敬的客户，因xxxx原因，现金宝将于' . date('m') . '月' . date('d') . '日终止定投业务。如有疑问请致电400-027-9899。',
    '18' =>'您于' . date('m月d日H时i分') . '，进行了%s基金定投操作，定投金额为%s元。如有疑问请致电400-027-9899。',
    '19' =>'您于' . date('m月d日H时i分') . '，修改了%s基金定投。如有疑问请致电400-027-9899。',
    '20' =>'尊敬的客户，因%s原因，%s基金将于%s暂停定投业务。如有疑问请致电400-027-9899。',
    '21' =>'尊敬的客户，%s基金将于%s恢复定投业务。如有疑问请致电400-027-9899。',
    '22' =>'尊敬的客户，因%s原因，%s基金将于%s终止定投业务。如有疑问请致电400-027-9899。',
);
//允许登录的域名
$config['allowedLoginDomain'] = array('buyfunds.cn','cnfol.com');
//IP白名单
//$config['whiteIPs'] = array('218.85.72.1', '58.22.114.199', '101.226.125.118', '61.183.83.170');
//$config['whiteIPs'] = array('218.85.72.1', '58.22.114.199', '101.226.125.118');
$config['whiteIPs'] = array();
//IP黑名单
$config['blackIPs'] = array();
/* End of file main_setting.php */
/* Location: ./application/config/main_setting.php */